# FaceEdgeNode Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FaceEdgeNode Properties
FaceEdgeNode Class See Also
---
The FaceEdgeNode type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from RenderNode.) |
| LineProperties | Access to the line (pen) properties of the curve being drawn.  (Inherited from FaceDetailNode.) |
| NodeName | A readable name of the output node.  (Inherited from RenderNode.) |

# See Also
FaceEdgeNode Class
Autodesk.Revit.DB Namespace